nxp-mcuxpresso/mcux-devices-mcx/MCXA/MCXA345/iar/startup_MCXA345.s
        PUBWEAK Reserved108_IRQHandler
        PUBWEAK Reserved108_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved108_IRQHandler
        LDR     R0, =Reserved108_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved109_IRQHandler
        PUBWEAK Reserved109_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved109_IRQHandler
        LDR     R0, =Reserved109_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved110_IRQHandler
        PUBWEAK Reserved110_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved110_IRQHandler
        LDR     R0, =Reserved110_DriverIRQHandler
        BX      R0

        PUBWEAK LPUART5_IRQHandler
        PUBWEAK LPUART5_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
LPUART5_IRQHandler
        LDR     R0, =LPUART5_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved112_IRQHandler
        PUBWEAK Reserved112_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved112_IRQHandler
        LDR     R0, =Reserved112_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved113_IRQHandler
        PUBWEAK Reserved113_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved113_IRQHandler
        LDR     R0, =Reserved113_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved114_IRQHandler
        PUBWEAK Reserved114_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved114_IRQHandler
        LDR     R0, =Reserved114_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved115_IRQHandler
        PUBWEAK Reserved115_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved115_IRQHandler
        LDR     R0, =Reserved115_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved116_IRQHandler
        PUBWEAK Reserved116_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved116_IRQHandler
        LDR     R0, =Reserved116_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved117_IRQHandler
        PUBWEAK Reserved117_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved117_IRQHandler
        LDR     R0, =Reserved117_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved118_IRQHandler
        PUBWEAK Reserved118_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved118_IRQHandler
        LDR     R0, =Reserved118_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved119_IRQHandler
        PUBWEAK Reserved119_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved119_IRQHandler
        LDR     R0, =Reserved119_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved120_IRQHandler
        PUBWEAK Reserved120_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved120_IRQHandler
        LDR     R0, =Reserved120_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved121_IRQHandler
        PUBWEAK Reserved121_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved121_IRQHandler
        LDR     R0, =Reserved121_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved122_IRQHandler
        PUBWEAK Reserved122_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved122_IRQHandler
        LDR     R0, =Reserved122_DriverIRQHandler
        BX      R0

        PUBWEAK MAU_IRQHandler
        PUBWEAK MAU_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
MAU_IRQHandler
        LDR     R0, =MAU_DriverIRQHandler
        BX      R0

        PUBWEAK SMARTDMA_IRQHandler
        PUBWEAK SMARTDMA_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
SMARTDMA_IRQHandler
        LDR     R0, =SMARTDMA_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved125_IRQHandler
        PUBWEAK Reserved125_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved125_IRQHandler
        LDR     R0, =Reserved125_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved126_IRQHandler
        PUBWEAK Reserved126_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved126_IRQHandler
        LDR     R0, =Reserved126_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved127_IRQHandler
        PUBWEAK Reserved127_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved127_IRQHandler
        LDR     R0, =Reserved127_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved128_IRQHandler
        PUBWEAK Reserved128_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved128_IRQHandler
        LDR     R0, =Reserved128_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved129_IRQHandler
        PUBWEAK Reserved129_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved129_IRQHandler
        LDR     R0, =Reserved129_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved130_IRQHandler
        PUBWEAK Reserved130_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved130_IRQHandler
        LDR     R0, =Reserved130_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved131_IRQHandler
        PUBWEAK Reserved131_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved131_IRQHandler
        LDR     R0, =Reserved131_DriverIRQHandler
        BX      R0

        PUBWEAK ADC2_IRQHandler
        PUBWEAK ADC2_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ADC2_IRQHandler
        LDR     R0, =ADC2_DriverIRQHandler
        BX      R0

        PUBWEAK ADC3_IRQHandler
        PUBWEAK ADC3_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
ADC3_IRQHandler
        LDR     R0, =ADC3_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved134_IRQHandler
        PUBWEAK Reserved134_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved134_IRQHandler
        LDR     R0, =Reserved134_DriverIRQHandler
        BX      R0

        PUBWEAK RTC_IRQHandler
        PUBWEAK RTC_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
RTC_IRQHandler
        LDR     R0, =RTC_DriverIRQHandler
        BX      R0

        PUBWEAK RTC_1HZ_IRQHandler
        PUBWEAK RTC_1HZ_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
RTC_1HZ_IRQHandler
        LDR     R0, =RTC_1HZ_DriverIRQHandler
        BX      R0

        PUBWEAK Reserved137_IRQHandler
        PUBWEAK Reserved137_DriverIRQHandler
        SECTION .text:CODE:REORDER:NOROOT(2)
Reserved137_IRQHandler
        LDR     R0, =Reserved137_DriverIRQHandler
        BX      R0

Reserved16_DriverIRQHandler
CMC_DriverIRQHandler
DMA_CH0_DriverIRQHandler
DMA_CH1_DriverIRQHandler
DMA_CH2_DriverIRQHandler
DMA_CH3_DriverIRQHandler
DMA_CH4_DriverIRQHandler
DMA_CH5_DriverIRQHandler
DMA_CH6_DriverIRQHandler
DMA_CH7_DriverIRQHandler
ERM0_SINGLE_BIT_DriverIRQHandler
ERM0_MULTI_BIT_DriverIRQHandler
FMU0_DriverIRQHandler
GLIKEY0_DriverIRQHandler
MBC0_DriverIRQHandler
SCG0_DriverIRQHandler
SPC0_DriverIRQHandler
Reserved33_DriverIRQHandler
WUU0_DriverIRQHandler
CAN0_DriverIRQHandler
Reserved36_DriverIRQHandler
Reserved37_DriverIRQHandler
Reserved38_DriverIRQHandler
Reserved39_DriverIRQHandler
Reserved40_DriverIRQHandler
Reserved41_DriverIRQHandler
LPI2C0_DriverIRQHandler
LPI2C1_DriverIRQHandler
LPSPI0_DriverIRQHandler
LPSPI1_DriverIRQHandler
Reserved46_DriverIRQHandler
LPUART0_DriverIRQHandler
LPUART1_DriverIRQHandler
LPUART2_DriverIRQHandler
LPUART3_DriverIRQHandler
LPUART4_DriverIRQHandler
Reserved52_DriverIRQHandler
Reserved53_DriverIRQHandler
CDOG0_DriverIRQHandler
CTIMER0_DriverIRQHandler
CTIMER1_DriverIRQHandler
CTIMER2_DriverIRQHandler
CTIMER3_DriverIRQHandler
CTIMER4_DriverIRQHandler
FLEXPWM0_RELOAD_ERROR_DriverIRQHandler
FLEXPWM0_FAULT_DriverIRQHandler
FLEXPWM0_SUBMODULE0_DriverIRQHandler
FLEXPWM0_SUBMODULE1_DriverIRQHandler
FLEXPWM0_SUBMODULE2_DriverIRQHandler
FLEXPWM0_SUBMODULE3_DriverIRQHandler
EQDC0_COMPARE_DriverIRQHandler
EQDC0_HOME_DriverIRQHandler
EQDC0_WATCHDOG_DriverIRQHandler
EQDC0_INDEX_DriverIRQHandler
FREQME0_DriverIRQHandler
LPTMR0_DriverIRQHandler
Reserved72_DriverIRQHandler
OS_EVENT_DriverIRQHandler
WAKETIMER0_DriverIRQHandler
UTICK0_DriverIRQHandler
WWDT0_DriverIRQHandler
Reserved77_DriverIRQHandler
ADC0_DriverIRQHandler
ADC1_DriverIRQHandler
CMP0_DriverIRQHandler
CMP1_DriverIRQHandler
CMP2_DriverIRQHandler
DAC0_DriverIRQHandler
Reserved84_DriverIRQHandler
Reserved85_DriverIRQHandler
Reserved86_DriverIRQHandler
GPIO0_DriverIRQHandler
GPIO1_DriverIRQHandler
GPIO2_DriverIRQHandler
GPIO3_DriverIRQHandler
GPIO4_DriverIRQHandler
Reserved92_DriverIRQHandler
LPI2C2_DriverIRQHandler
LPI2C3_DriverIRQHandler
FLEXPWM1_RELOAD_ERROR_DriverIRQHandler
FLEXPWM1_FAULT_DriverIRQHandler
FLEXPWM1_SUBMODULE0_DriverIRQHandler
FLEXPWM1_SUBMODULE1_DriverIRQHandler
FLEXPWM1_SUBMODULE2_DriverIRQHandler
FLEXPWM1_SUBMODULE3_DriverIRQHandler
EQDC1_COMPARE_DriverIRQHandler
EQDC1_HOME_DriverIRQHandler
EQDC1_WATCHDOG_DriverIRQHandler
EQDC1_INDEX_DriverIRQHandler
Reserved105_DriverIRQHandler
Reserved106_DriverIRQHandler
Reserved107_DriverIRQHandler
Reserved108_DriverIRQHandler
Reserved109_DriverIRQHandler
Reserved110_DriverIRQHandler
LPUART5_DriverIRQHandler
Reserved112_DriverIRQHandler
Reserved113_DriverIRQHandler
Reserved114_DriverIRQHandler
Reserved115_DriverIRQHandler
Reserved116_DriverIRQHandler
Reserved117_DriverIRQHandler
Reserved118_DriverIRQHandler
Reserved119_DriverIRQHandler
Reserved120_DriverIRQHandler
Reserved121_DriverIRQHandler
Reserved122_DriverIRQHandler
MAU_DriverIRQHandler
SMARTDMA_DriverIRQHandler
Reserved125_DriverIRQHandler
Reserved126_DriverIRQHandler
Reserved127_DriverIRQHandler
Reserved128_DriverIRQHandler
Reserved129_DriverIRQHandler
Reserved130_DriverIRQHandler
Reserved131_DriverIRQHandler
ADC2_DriverIRQHandler
ADC3_DriverIRQHandler
Reserved134_DriverIRQHandler
RTC_DriverIRQHandler
RTC_1HZ_DriverIRQHandler
Reserved137_DriverIRQHandler
DefaultISR
        B .

        END
